app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-07-06 08:14:18', 'Dinosaurs romp', 'Have you seen a dinosaur on a rampage? They do that when they are in a rage.', '2010-07-06 08:14:18')

  def update
    @post = Post.find(params[:id])
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2010-07-07 06:50:25', `body` = 'Have you seen a dinosaur on a <b>rampage</b>? They do that when they are in a rage.' WHERE `id` = 1